const alphabet = {
  'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..',
  'e': '.', 'f': '..-.', 'g': '--.', 'h': '....',
  'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..',
  'm': '--', 'n': '-.', 'o': '---', 'p': '.--.',
  'q': '--.-', 'r': '.-.', 's': '...', 't': '-',
  'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-',
  'y': '-.--', 'z': '--..', ' ': '/', '?': '..--..',
  '1': '.----', '2': '..---', '3': '...--', '4': '....-',
  '5': '.....', '6': '-....', '7': '--...', '8': '---..',
  '9': '----.', '0': '-----', '!': '-.-.--', ',': '--..--'
}

const reverse_alphabet = {
  '.-': 'a', '-...': 'b', '-.-.': 'c', '-..': 'd', '.': 'e',
  '..-.': 'f', '--.': 'g', '....': 'h', '..': 'i', '.---': 'j',
  '-.-': 'k', '.-..': 'l', '--': 'm', '-.': 'n', '---': 'o',
  '.--.': 'p', '--.-': 'q', '.-.': 'r', '...': 's', '-': 't',
  '..-': 'u', '...-': 'v', '.--': 'w', '-..-': 'x', '-.--': 'y',
  '--..': 'z', '.----': '1', '..---': '2', '...--': '3', '....-': '4',
  '.....': '5', '-....': '6', '--...': '7', '---..': '8', '----.': '9',
  '-----': '10', '-.-.--': '!', '--..--': ',', '..--..': '?'
};

const encodeMorseSymbol = (symbol) => {
  let result = alphabet[symbol.toLowerCase()] || '';

  return result;
}

const encodeMorseText = (text) => {
  return text
    .split('')            // перетворення в масив букв []
    .map((e) => {     // заміна кожної букви на відповідник із таблицю азбуки Морзе
      return alphabet[e.toLowerCase()] || '';
    })
    .join(' ')            // перетворення масиву назад в строку
    .replace(/ +/g, ' '); // Заміна подвійних пробілів 

}

const decodeMorseSymbol = (symbol) => {
  let result = reverse_alphabet[symbol] || '?';

  return result;
}

const decodeMorseText = (text) => {
  return text
    .split(' ')      // перетворення в масив букв по азбуці Морзе розділених по пробілам []
    .map((e) => {     // заміна кожної букви на відповідник із таблицю азбуки Морзе
      return reverse_alphabet[e] || '?';
    })
    .join(' ')            // перетворення масиву назад в строку

}

export {
  encodeMorseSymbol,
  encodeMorseText,
  decodeMorseSymbol,
  decodeMorseText
}
